export const help = ({ domainName }) => `\
*Шоб шо?*
Бот було створено з ціллю отримання повідомлень про відключення/включення світла удома.

*Як це працює?*
Задля роботи боту, вам (або комусь з мешканців будинку) потрібно зареєструвати пристрій, який має періодично сигналізувати про наявність світла.

Якщо за декілька хвилин від пристрою не надійде жодного сигналу, бот повідомить вас про відсутність світла.

_Примітка: з 22:00 до 6:00 бот надсилає повідомлення без звукового сповіщення._

*Якщо вам вже надали ідентифікатор пристрою:*
Все, що треба зробити - це підписатися на оновлення пристрою за допомогою відповідної команди меню.

_Примітка: ви можете підписатися на будь-яку кількість пристроїв, та отримувати повідомлення від них усіх одночасно._

*Якщо ви хочете зареєструвати новий пристрій:*
Згенеруйте дані доступу (ідентифікатор та токен) за допомогою команди створення пристрою.

Забезпечте механізм оновлення статусу пристрою.
Детальніше тут: https://${domainName}/devices/alive-page

_Примітка: при створенні пристрою, обирайте більш зрозумілі назви (наприклад, "Чорнобаївська 9/10" замість "Дім, милий дім"), щоб цією інформацією потім можна було поділитися з сусідами._

*Last but not least:*
Бот працює у тестовому режимі (на віки вічні) та на слабенькому сервері - тому не душіть 😊
Баг-репорти слати сюди: https://github.com/artemtrush/power-outage-bot/issues

Всім світла ✨
`;

export const createDeviceSuccess = ({ deviceName, deviceId, deviceToken }) => `\
*Пристрій успішно створено.*

Назва: ${escape(deviceName)}
Ідентифікатор: ${deviceId}
Токен: ${deviceToken}

Ви були автоматично підписані на створений пристрій.
Зверніться до розділу допомоги задля отримання інформації щодо оновлення статусу пристрою.
`;

export const createDeviceError = ({ command, error }) => `\
*Помилка створення пристрою:*
${error.reason}

Приклад використання:
/${command} Чорнобаївська 9/10
`;


export const listDevicesSuccess = ({ devices }) => `\
*Список моїх підписок:*
${devices.map(({ deviceName, deviceId, deviceToken }) => `\
Назва: ${escape(deviceName)}
Ідентифікатор: ${deviceId}
Токен: ${deviceToken ? deviceToken : escape('***') }
`).join('\n')}
`;

export const listDevicesError = ({ error }) => `\
*Помилка отримання списку підписок:*
${error.reason}
`;


export const subscribeToDeviceSuccess = ({ deviceName }) => `\
*Пристрій успішно додано до списку підписок.*

Назва: ${escape(deviceName)}
`;

export const subscribeToDeviceError = ({ command, error }) => `\
*Помилка підписки на пристрій:*
${error.reason}

Приклад використання:
/${command} 12345678
`;


export const unsubscribeFromDeviceSuccess = ({ deviceName }) => `\
*Пристрій успішно видалено зі списку підписок.*

Назва: ${escape(deviceName)}
`;

export const unsubscribeFromDeviceError = ({ command, error }) => `\
*Помилка відписки від пристрою:*
${error.reason}

Приклад використання:
/${command} 12345678
`;

function escape(string) {
    // eslint-disable-next-line no-useless-escape
    return string.replaceAll(/([\_\*\`\[])/g, '\\$1');
}
